<script setup>
import PartsCard from "~/components/PartsCard.vue";
import { PARTS } from "~/constants/parts";
</script>

<template>
  <header>
    <div class="px-10 pb-2">
      <div class="grid grid-cols-5 items-center gap-2.5 pt-4">
        <div>
          <a href="#">
            <img src="~/assets/icons/logo.svg" alt="logo" />
          </a>
        </div>
        <nav class="col-span-3">
          <ul class="flex justify-between text-sm">
            <li><a href="#" class="px-4 py-2">О компании</a></li>
            <li><a href="#" class="px-4 py-2">Контакты</a></li>
            <li><a href="#" class="px-4 py-2">Доставка</a></li>
            <li><a href="#" class="px-4 py-2">Оплата</a></li>
            <li><a href="#" class="px-4 py-2">Гарантия</a></li>
          </ul>
        </nav>
        <div class="w-full">
          <button
            class="ml-auto flex w-[200px] items-center gap-2 rounded-[5px] bg-main-blue px-4 text-sm font-medium leading-[50px] text-white"
          >
            <svg
              width="28"
              height="28"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="m21.905 10.617-4.521-4.52 2.041-2.043c.33-.33.74-.495 1.225-.495.487 0 .895.165 1.225.495l2.071 2.071c.33.33.496.74.496 1.225 0 .486-.165.895-.496 1.225l-2.041 2.042ZM3.5 24.5v-4.55l5.659-5.658-6.446-6.475 5.075-5.133 6.504 6.504 3.092-3.092 4.52 4.52-3.091 3.093 6.504 6.504-5.104 5.046-6.475-6.446L8.05 24.5H3.5Zm6.913-11.462 2.625-2.625-2.13-2.13-1.4 1.4L8.285 8.46l1.4-1.4-1.867-1.867-2.625 2.625 5.22 5.22Zm9.742 9.77 2.625-2.624-1.867-1.867-1.4 1.4-1.225-1.225 1.4-1.4-2.13-2.13-2.624 2.626 5.22 5.22ZM5.25 22.75h2.042l12.104-12.104-2.041-2.042L5.25 20.71v2.041Z"
                fill="#fff"
              />
            </svg>
            Конфигуратор ПК
          </button>
        </div>
      </div>
    </div>
  </header>
  <div class="sticky top-0 bg-white py-4">
    <div class="px-10">
      <div class="flex items-center gap-6">
        <a
          href="tel:5418080"
          class="flex items-center gap-3 text-[1.875rem] font-semibold text-main-blue"
        >
          <span>
            <img src="~/assets/icons/mobile-logos.svg" alt="mobile logos" />
          </span>
          541-80-80
        </a>
        <ul>
          <li>
            <div>
              <button
                class="ml-auto flex w-[200px] items-center gap-2 rounded-[5px] bg-main-blue px-4 text-sm font-medium leading-[50px] text-white"
              >
                <div class="flex w-6 items-center justify-center">
                  <svg
                    width="24"
                    height="20"
                    viewBox="0 0 24 20"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                    class="menu-open-true"
                  >
                    <path
                      d="M8.20834 17.5833H21.9167V13.5875H8.20834V17.5833ZM2.08334 6.41249H6.45834V2.41666H2.08334V6.41249ZM2.08334 11.8667H6.45834V8.16249H2.08334V11.8667ZM2.08334 17.5833H6.45834V13.5875H2.08334V17.5833ZM8.20834 11.8667H21.9167V8.16249H8.20834V11.8667ZM8.20834 6.41249H21.9167V2.41666H8.20834V6.41249ZM2.08334 19.3333C1.61668 19.3333 1.20834 19.1583 0.858343 18.8083C0.508344 18.4583 0.333344 18.05 0.333344 17.5833V2.41666C0.333344 1.94999 0.508344 1.54166 0.858343 1.19166C1.20834 0.841656 1.61668 0.666656 2.08334 0.666656H21.9167C22.3833 0.666656 22.7917 0.841656 23.1417 1.19166C23.4917 1.54166 23.6667 1.94999 23.6667 2.41666V17.5833C23.6667 18.05 23.4917 18.4583 23.1417 18.8083C22.7917 19.1583 22.3833 19.3333 21.9167 19.3333H2.08334Z"
                      fill="currentColor"
                    ></path>
                  </svg>
                </div>
                Каталог товаров
              </button>
            </div>
          </li>
        </ul>
        <div class="flex-1">
          <div
            class="relative -ml-3 rounded-[5px] border-2 border-main-gray px-4 leading-[48px]"
          >
            <input
              class="input"
              placeholder="Введите наименование или артикул товара"
              type="text"
              value=""
            /><button
              type="submit"
              class="absolute right-4 top-1/2 -translate-y-1/2"
            >
              <svg
                width="22"
                height="22"
                viewBox="0 0 22 22"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M20.2167 21.4708L12.5458 13.8C11.9625 14.3055 11.2823 14.6993 10.5054 14.9812C9.72838 15.2632 8.90159 15.4042 8.025 15.4042C5.92185 15.4042 4.1419 14.675 2.68514 13.2167C1.22838 11.7583 0.5 9.9986 0.5 7.93749C0.5 5.87638 1.22917 4.11666 2.6875 2.65833C4.14583 1.19999 5.91042 0.470825 7.98125 0.470825C10.0521 0.470825 11.8118 1.19999 13.2604 2.65833C14.709 4.11666 15.4333 5.87784 15.4333 7.94187C15.4333 8.77506 15.2972 9.58055 15.025 10.3583C14.7528 11.1361 14.3444 11.8653 13.8 12.5458L21.5 20.1875L20.2167 21.4708ZM7.99583 13.6542C9.57569 13.6542 10.9186 13.0951 12.0245 11.9771C13.1304 10.859 13.6833 9.51249 13.6833 7.93749C13.6833 6.36249 13.1304 5.01596 12.0245 3.89791C10.9186 2.77985 9.57569 2.22083 7.99583 2.22083C6.39978 2.22083 5.04312 2.77985 3.92586 3.89791C2.80862 5.01596 2.25 6.36249 2.25 7.93749C2.25 9.51249 2.80862 10.859 3.92586 11.9771C5.04312 13.0951 6.39978 13.6542 7.99583 13.6542Z"
                  fill="currentColor"
                ></path>
              </svg>
            </button>
          </div>
        </div>
        <div class="flex items-end gap-6 text-[0.875rem]">
          <a href="#" class="flex flex-col items-center justify-center gap-1">
            <svg
              width="28"
              height="28"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M14 13.97c-1.284 0-2.334-.408-3.15-1.224-.817-.817-1.226-1.867-1.226-3.15 0-1.284.409-2.334 1.225-3.15.817-.817 1.867-1.225 3.15-1.225 1.284 0 2.334.408 3.15 1.225.817.816 1.225 1.866 1.225 3.15 0 1.283-.408 2.333-1.225 3.15-.816.816-1.866 1.225-3.15 1.225Zm-9.334 9.363v-2.741c0-.74.185-1.371.554-1.896.37-.525.846-.924 1.43-1.196 1.302-.584 2.551-1.021 3.747-1.313A15.149 15.149 0 0 1 14 15.75c1.206 0 2.402.15 3.588.452a24.4 24.4 0 0 1 3.73 1.303 3.523 3.523 0 0 1 1.465 1.195c.367.522.55 1.153.55 1.892v2.741H4.667Zm1.75-1.75h15.167v-.991c0-.312-.093-.608-.277-.89a1.756 1.756 0 0 0-.686-.627c-1.244-.603-2.382-1.016-3.412-1.24-1.03-.223-2.1-.335-3.209-.335-1.108 0-2.187.112-3.237.335-1.05.224-2.188.637-3.413 1.24a1.657 1.657 0 0 0-.67.627 1.66 1.66 0 0 0-.263.89v.991Zm7.583-9.362c.759 0 1.386-.248 1.882-.744.495-.496.743-1.123.743-1.881 0-.759-.248-1.386-.743-1.882-.496-.495-1.123-.743-1.882-.743-.758 0-1.385.248-1.88.743-.497.496-.745 1.123-.745 1.882 0 .758.248 1.385.744 1.881s1.123.744 1.881.744Z"
                fill="#000"
              />
            </svg>
            Войти
          </a>
          <a href="#" class="flex flex-col items-center justify-center gap-1">
            <svg
              width="24"
              height="20"
              viewBox="0 0 24 20"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M12.8167 15.2208L15.3833 13.4417L17.9208 15.2208L16.9583 12.1292L19.4958 10H16.4042L15.3833 6.96667L14.3333 10H11.2417L13.7792 12.1292L12.8167 15.2208ZM2.11249 19.3333C1.64582 19.3333 1.23749 19.1535 0.887488 18.7938C0.537488 18.434 0.362488 18.0306 0.362488 17.5833V2.41667C0.362488 1.96945 0.537488 1.56598 0.887488 1.20626C1.23749 0.846533 1.64582 0.666672 2.11249 0.666672H10.2792L12.0292 2.41667H21.9458C22.393 2.41667 22.7965 2.59653 23.1562 2.95625C23.516 3.31598 23.6958 3.71945 23.6958 4.16667V17.5833C23.6958 18.0306 23.516 18.434 23.1562 18.7938C22.7965 19.1535 22.393 19.3333 21.9458 19.3333H2.11249ZM2.11249 2.41667V17.5833H21.9458V4.16667H11.3L9.54999 2.41667H2.11249Z"
                fill="currentColor"
              ></path>
            </svg>
            Сохранить
          </a>
          <a href="#" class="flex flex-col items-center justify-center gap-1">
            <svg
              width="22"
              height="22"
              viewBox="0 0 22 22"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M5.28333 16.9208H7.03333V8.9H5.28333V16.9208ZM10.125 16.9208H11.875V5.07917H10.125V16.9208ZM14.9667 16.9208H16.7167V12.6042H14.9667V16.9208ZM2.25 21.5C1.78333 21.5 1.375 21.325 1.025 20.975C0.675 20.625 0.5 20.2167 0.5 19.75V2.25C0.5 1.78333 0.675 1.375 1.025 1.025C1.375 0.675 1.78333 0.5 2.25 0.5H19.75C20.2167 0.5 20.625 0.675 20.975 1.025C21.325 1.375 21.5 1.78333 21.5 2.25V19.75C21.5 20.2167 21.325 20.625 20.975 20.975C20.625 21.325 20.2167 21.5 19.75 21.5H2.25ZM2.25 19.75H19.75V2.25H2.25V19.75Z"
                fill="currentColor"
              ></path>
            </svg>
            Сравнить
          </a>
          <a
            href="#"
            class="flex flex-col items-center justify-center gap-1 text-main-blue"
          >
            <svg
              width="24"
              height="27"
              viewBox="0 0 24 27"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M2.625 26.5C2.125 26.5 1.6875 26.3125 1.3125 25.9375C0.9375 25.5625 0.75 25.125 0.75 24.625V8.0625C0.75 7.5625 0.9375 7.125 1.3125 6.75C1.6875 6.375 2.125 6.1875 2.625 6.1875H6.0625C6.0625 4.54167 6.61458 3.14062 7.71875 1.98438C8.82292 0.828125 10.1979 0.25 11.8438 0.25C13.4896 0.25 14.9167 0.828906 16.125 1.98672C17.3333 3.14453 17.9375 4.54479 17.9375 6.1875H21.375C21.875 6.1875 22.3125 6.375 22.6875 6.75C23.0625 7.125 23.25 7.5625 23.25 8.0625V24.625C23.25 25.125 23.0625 25.5625 22.6875 25.9375C22.3125 26.3125 21.875 26.5 21.375 26.5H2.625ZM2.625 24.625H21.375V8.0625H2.625V24.625ZM12 15.5625C13.6458 15.5625 15.0729 14.9583 16.2812 13.75C17.4896 12.5417 18.0938 11.1146 18.0938 9.46875H16.2188C16.2188 10.6146 15.8021 11.6042 14.9688 12.4375C14.1354 13.2708 13.1458 13.6875 12 13.6875C10.8542 13.6875 9.86458 13.2708 9.03125 12.4375C8.19792 11.6042 7.78125 10.6146 7.78125 9.46875H5.90625C5.90625 11.1146 6.51042 12.5417 7.71875 13.75C8.92708 14.9583 10.3542 15.5625 12 15.5625ZM7.9375 6.1875H16.0625C16.0625 5.04167 15.6719 4.07812 14.8906 3.29688C14.1094 2.51562 13.1458 2.125 12 2.125C10.8542 2.125 9.89062 2.51562 9.10938 3.29688C8.32812 4.07812 7.9375 5.04167 7.9375 6.1875Z"
                fill="currentColor"
              ></path>
            </svg>
            Купить
          </a>
        </div>
      </div>
    </div>
  </div>
  <main class="text text-sm">
    <div class="box-lg">
      <div class="px-10">
        <div class="mb-8 mt-4 text-xs font-medium text-main-gray">
          <a href="#">Главная</a>
          <span> / Конфигуратор компьютера</span>
        </div>
        <div class="flex gap-4">
          <div class="flex flex-1 flex-col">
            <h1 class="mb-8 text-3xl font-semibold">Конфигуратор компьютера</h1>
            <div class="flex flex-col">
              <a class="mb-5 text-sm text-main-blue underline" href="#"
                >Отправить заявку на сборку компьютера</a
              >
              <p class="mb-5 text-sm">
                Приглашаем самостоятельно собрать уникальный персональный
                компьютер с помощью Конфигуратора ПК IVEN. Система конфигуратора
                подскажет, какие детали являются необходимыми и совместимыми с
                выбранной Вами системой.
              </p>
              <div class="mb-9 flex gap-16 text-sm">
                <div class="flex items-center gap-2 text-main-blue">
                  <svg
                    width="30"
                    height="30"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M20 10V6.25H10V10H7.5V3.75h15V10H20Zm2.5 5.625c.354 0 .651-.12.89-.36.24-.239.36-.536.36-.89s-.12-.651-.36-.89a1.21 1.21 0 0 0-.89-.36c-.354 0-.651.12-.89.36-.24.239-.36.536-.36.89s.12.651.36.89c.239.24.536.36.89.36ZM20 23.75v-5H10v5h10Zm2.5 2.5h-15v-5h-5v-7.5c0-1.063.365-1.953 1.094-2.672C4.323 10.36 5.208 10 6.25 10h17.5c1.063 0 1.953.36 2.672 1.078.719.719 1.078 1.61 1.078 2.672v7.5h-5v5Zm2.5-7.5v-5c0-.354-.12-.651-.36-.89a1.21 1.21 0 0 0-.89-.36H6.25c-.354 0-.651.12-.89.36-.24.239-.36.536-.36.89v5h2.5v-2.5h15v2.5H25Z"
                      fill="currentColor"
                    />
                  </svg>
                  <p class="underline">Распечатать конфигурацию</p>
                </div>
                <div class="flex items-center gap-2 text-main-blue">
                  <svg
                    width="28"
                    height="28"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="m14.817 19.221 2.567-1.779 2.538 1.78-.963-3.093L21.497 14h-3.092l-1.02-3.033L16.334 14h-3.093l2.538 2.13-.963 3.091ZM4.113 23.334c-.466 0-.875-.18-1.225-.54-.35-.36-.525-.763-.525-1.21V6.417c0-.447.175-.85.525-1.21.35-.36.759-.54 1.225-.54h8.167l1.75 1.75h9.917c.447 0 .85.18 1.21.54.36.36.54.763.54 1.21v13.417c0 .447-.18.85-.54 1.21-.36.36-.763.54-1.21.54H4.113Zm0-16.917v15.167h19.834V8.167H13.3l-1.75-1.75H4.113Z"
                      fill="currentColor"
                    />
                  </svg>
                  <p class="underline">Сохранить конфигурацию</p>
                </div>
                <div class="flex items-center gap-2 text-main-blue">
                  <svg
                    width="30"
                    height="30"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M8.156 26.25c-.515 0-.957-.184-1.324-.55a1.806 1.806 0 0 1-.55-1.325V6.562H5V4.688h5.875V3.75h8.25v.938H25v1.875h-1.281v17.812c0 .5-.188.938-.563 1.313-.375.375-.812.562-1.312.562H8.156ZM21.844 6.562H8.156v17.813h13.688V6.562ZM11.469 21.688h1.875V9.22h-1.875v12.469Zm5.187 0h1.875V9.22h-1.875v12.469Z"
                      fill="currentColor"
                    />
                  </svg>
                  <p class="underline">Очистить конфигурацию</p>
                </div>
                <div class="flex items-center gap-2 text-[#E5A35B]">
                  <svg
                    width="30"
                    height="30"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M14.875 21.25c.438 0 .807-.151 1.11-.453.302-.302.453-.672.453-1.11 0-.437-.151-.807-.454-1.109a1.509 1.509 0 0 0-1.109-.453c-.438 0-.807.151-1.11.453a1.509 1.509 0 0 0-.453 1.11c0 .437.152.807.454 1.109.302.302.671.453 1.109.453Zm-1.125-4.813h2.313c0-.354.015-.656.046-.906.032-.25.1-.49.203-.719.105-.229.235-.442.391-.64.156-.198.38-.443.672-.735.73-.729 1.245-1.338 1.547-1.828.302-.49.453-1.046.453-1.671 0-1.105-.375-1.995-1.125-2.672S16.49 6.25 15.219 6.25c-1.146 0-2.12.281-2.922.844-.802.562-1.36 1.343-1.672 2.343l2.063.813a2.463 2.463 0 0 1 .874-1.36 2.407 2.407 0 0 1 1.532-.515c.562 0 1.031.151 1.406.453.375.302.563.703.563 1.203 0 .354-.115.73-.344 1.125-.23.396-.615.834-1.157 1.313-.354.291-.64.578-.859.86a4.658 4.658 0 0 0-.547.89c-.146.312-.25.64-.312.984a6.999 6.999 0 0 0-.094 1.235ZM15 28.75 11.25 25h-5a2.407 2.407 0 0 1-1.766-.734A2.407 2.407 0 0 1 3.75 22.5V5c0-.688.245-1.276.734-1.766A2.407 2.407 0 0 1 6.25 2.5h17.5c.688 0 1.276.245 1.766.734.49.49.734 1.079.734 1.766v17.5c0 .688-.245 1.276-.734 1.766-.49.49-1.078.734-1.766.734h-5L15 28.75ZM6.25 22.5h6L15 25.25l2.75-2.75h6V5H6.25v17.5Z"
                      fill="currentColor"
                    />
                  </svg>
                  <p class="underline">Заказать консультацию</p>
                </div>
              </div>
              <div class="mb-4 text-2xl text-main-blue">Системный блок</div>
              <div class="flex flex-col gap-1">
                <PartsCard
                  v-for="(value, key) in PARTS"
                  :iconName="key"
                  :name="value.name"
                />
              </div>
            </div>
          </div>
          <div class="flex w-[322px] flex-col">
            <div class="mb-5 rounded-[5px] bg-[#e5a35b1a] p-5">
              <div class="mb-7 text-2xl font-semibold">
                Стоимость конфигурации:
              </div>
              <div class="mb-5 flex justify-between text-sm font-light">
                <div>Всего товаров:</div>
                <div>0</div>
              </div>
              <div class="mb-8 h-[2px] bg-[#E5A35B]"></div>
              <div class="mb-8 flex justify-between text-lg font-semibold">
                <div>Сумма заказа:</div>
                <div>0 Br</div>
              </div>
              <button
                class="mb-6 flex w-full flex-1 items-center justify-center rounded-[5px] bg-main-blue p-3 text-sm font-medium text-white"
              >
                Оформить заказ
              </button>
              <div class="text-center text-xs font-light">
                Нажимая на кнопку "Оформить заказ", Вы соглашаетесь с
                <a href="#" class="underline">обработкой персональных данных</a>
                и <a href="#" class="underline">Договором публичной оферты</a>
              </div>
            </div>
            <p class="px-4 text-sm">
              Самовывоз только в Минске.
              <br /><br />
              Стоимость и сроки доставки по РБ уточняйте в отделе продаж.
              <br /><br />
              Возможность и стоимость доставки по стране в удобный для Вас день
              уточняйте у специалиста call-центра.
            </p>
          </div>
        </div>
      </div>
    </div>
  </main>
</template>
